[{
    "_id": "1050",
    "subcode": "17AE45",
    "subname": "Aircraft Material Science",
    "m1": "Module 1",
    "m1desc": "Introduction to Aircraft Materials: \nGeneral properties of materials, Definition of terms, Requirements of aircraft materials, Testing of aircraft materials, Inspection methods, Application and trends in usage in aircraft structures and engines, Selection of materials for use in aircraft.",
    "m2": "Module 2",
    "m2desc": "Super Alloys: \nGeneral introduction to super alloys, Nickel based super alloys, Cobalt based super alloys, and Iron based super alloys, manufacturing processes associated with super alloys, Heat treatment and surface treatment of super alloys. \n\nComposite Materials:\nDefinition and comparison of composites with conventional monolithic materials, Reinforcing fibers and Matrix materials, Fabrication of composites and quality control aspects, Carbon-Carbon Composites production, properties and applications, inter metallic matrix composites, ablative composites based on polymers, ceramic matrix, metal matrix composites based on aluminum, magnesium, titanium and nickel based composites for engines.",
    "m3": "Module 3",
    "m3desc": "Polymers, Polymeric Materials & Plastics and Ceramics & Glass: \nKnowledge and identification of physical characteristics of commonly used polymeric material: plastics and its categories, properties and applications; commonly used ceramic, glass and transparent plastics, properties and applications, adhesives and sealants and their applications in aircraft.",
    "m4": "Module 4",
    "m4desc": "Ablative Materials  : \nAblation process, ablative materials and applications in aerospace. Aircraft Wood, Rubber, Fabrics & Dope and Paint: Classification and properties of wood, Seasoning of wood, Aircraft woods, their properties and applications, Joining processes for wood, Plywood; Characteristics and definition of terminologies pertaining to aircraft fabrics and their applications, Purpose of doping and commonly used dopes; Purpose of painting, Types of aircraft paints, Aircraft painting process.",
    "m5": "Module 5",
    "m5desc": "Corrosion and its Prevention :\nKnowledge of the various methods used for removal of corrosion from common aircraft metals and methods employed to prevent corrosion.\n\n High Energy Materials: \nMaterials for rockets and missiles. Types of propellants and its general and desirable properties, insulating materials for cryogenic engines. Types of solid propellants: Mechanical characterization of solid propellants using uni-axial, strip-biaxial and tubular tests.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. Titterton G F , “Aircraft Material and Processes”,  English Book Store, New Delhi, 1998, ISBN 13: 9788175980136. \n2. H Buhl, “Advanced Aerospace Material”, Spring Berlin 1992, ISBN: 978-3-642-50161-6.\n\nReference Books:  \n1. C G Krishnadas Nair, “Handbook of Aircraft materials”, Interline publishers, Bangalore, 1993, ISBN 13: 9788172960032. \n2. Balram Gupta, S, “Aerospace material” Vol. 1,2,3 ARDB, Chand & Co 1996, ISBN: 9788121922005 \n3. Parker E R, “Materials for Missiles and Space”, John Wiley, McGraw-Hill, 1963, 4. Hill E T, The “Materials of Aircraft Construction”, Pitman London.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
