[{
    "_id": "1020",
    "subcode": "17AE42",
    "subname": "Aerodynamics-I",
    "m1": "Module 1",
    "m1desc": "Review of Basic Fluid Mechanics: \nContinuity, momentum and energy equation, Control volume approach to Continuity, momentum and energy equation, Types of flow, pathlines, streamlines, and streaklines, units and dimensions, inviscid and viscous flows, compressibility, Mach number regimes. Vorticity, Angular velocity, Stream function, velocity potential function, Circulation, Numericals, Mach cone and Mach angle, Speed of sound.",
    "m2": "Module 2",
    "m2desc": "Airfoil Characteristics: \nFundamental aerodynamic variables, Airfoil nomenclature, airfoil characteristics. wing planform geometry, aerodynamic forces and moments, centre of pressure, pressure coefficient, aerodynamic center, calculation of airfoil lift and drag from measured surface pressure distributions, typical airfoil aerodynamic characteristics at low speeds. Types of drag-Definitions.",
    "m3": "Module 3",
    "m3desc": "Two Dimensional Flows   & Incompressible Flow Over Airfoil: \nUniform flow, Source flow, Sink flow, Combination of a uniform flow with source and sink.  Doublet flow. Non-lifting flow over a circular cylinder. Vortex flow.  Lifting flow over a circular cylinder.  KuttaJoukowski theorem and generation of Lift, D’Alembert’s paradox, Numericals,\n\n  Incompressible flow over airfoils: \nKelvin’s circulation theorem and the starting vortex, vortex sheet, Kutta condition, Classical thin airfoil theory for symmetric and cambered airfoils. Kutta-Joukowski theorem and generation of Lift, Numericals.",
    "m4": "Module 4",
    "m4desc": "Incompressible Flow Over Finite Wings: \nBiot-Savart law and Helmholtz’s theorems, Vortex filament: Infinite and semi-infinite vortex filament, Induced velocity.  Prandtl’s classical lifting line theory:  Downwash and induced  drag.  Elliptical and modified elliptical lift distribution.  Lift distribution on wings. Limitations of Prandtl’s lifting line theory. Extended lifting line theory- lifting surface theory, vortex lattice method for wings. Lift, drag and moment characteristics of complete airplane.",
    "m5": "Module 5",
    "m5desc": "Applications of Finite Wing Theory & High Lift Systems: \nSimplified horse-shoe vortex model, formation flight, influence of downwash on tail plane, ground effects. Swept wings: Introduction to sweep effects, swept wings, pressure coefficient, typical aerodynamic characteristics, Subsonic and Supersonic leading edges. Introduction to high-lift systems, flaps, leading-edge slats and typical high – lift characteristics. critical Mach  numbers,  Lift  and  drag  divergence,  shock  induced  separation, Effects of thickness, camber and aspect ratio of wings, Transonic area rule, Tip effects. Introduction to Source panel & vortex latice method.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. Anderson J.D, “Fundamental of Aerodynamics”, 5th edition, McGraw-Hill International Edition, New York (2011), ISBN-13: 978-0073398105. \n2. E. L. Houghton, P.W. Carpenter, “Aerodynamics for Engineering Students”, 5th edition, Elsevier, New York. (2010), ISBN-13: 978-0080966328 \n\nReference Books:  \n1. Clancy L. J. “Aerodynamics”, Sterling book house, New Delhi. (2006), ISBN 13: 9780582988804  \n2. Louis M. Milne-Thomson, “Theoretical Aerodynamics”, Imported Edition, Dover Publications, USA (2011), ISBN 9780486619804.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
