[{
      "_id": "5ef76adabc428605b401fcec",
      "subcode": "17AE32",
      "subname": "Elements of Aeronautics",
      "m1": "Module 1",
      "m1desc": "Introduction to Aircrafts History of aviation; \n Atmosphere and its properties; Classification of aircrafts; Basic components of an aircraft; structural members; aircraft axis system; aircraft motions; control surfaces and high lift devices; classification of aircraft; conventional design configurations; principle of operation of each major part; Helicopters, their parts and functions. \n\n Aircraft Structures and Materials: \n    Introduction; general types of construction; monocoque, semimonocoque and geodesic structures; typical wing and fuselage structure; metallic and non-metallic materials for aircraft application. ",
      "m2": "Module 2",
      "m2desc": "Basic principles of flight –\n significance of speed of sound; airspeed and groundspeed; standard atmosphere; Bernoulli’s theorem and its application for generation of lift and measurement of airspeed; forces over wing section, aerofoil nomenclature, pressure distribution over a wing section. Lift and drag components – generation of lift and drag; lift curve, drag curve, types of drag, factors affecting lift and drag; centre of pressure and its significance; aerodynamic centre, aspect ratio, Mach number and supersonic flight effects; simple problems on lift and drag",
    "m3": "Module 3",
      "m3desc": "Aircraft Propulsion: \n Aircraft power plants, classification based on power plant and location and principle of operation. Turboprop, turbojet and turbofan engines; ramjets and scramjets; performance characteristics. Aircraft power plants – basic principles of piston, turboprop and jet engines;  ",
      "m4": "Module 4",
      "m4desc": "Aircraft Stability:\n Forces on an aircraft in flight; static and dynamic stability; longitudinal, lateral and roll stability; necessary conditions for longitudinal stability; basics of aircraft control systems. Effect of flaps and stats on lift, control tabs, stalling, gliding, landing, turning, aircraft manoeuvres; stalling, gliding, turning. Simple problems on these. Performance of aircraft – power curves, maximum and minimum speeds for horizontal flight at a given altitude; effect of changes in engine power and altitude on performance; correct and incorrect angles of bank; aerobatics, inverted manoeuvre, manoeuvrability. Simple problems. ",
      "m5": "Module 5",
      "m5desc": "Aircraft Systems:  \n Mechanical systems and their components; hydraulic and pneumatic systems; oxygen System; environmental Control System; fuel system. Electrical systems, flight deck and cockpit systems; navigation system, communication system. \n\n  Aircraft systems (Mechanical) – \nhydraulic and pneumatic systems and their applications; environment control system; fuel system, oxygen system.  \n\n Aircraft systems (Electrical) – \n flight control system, cockpit instrumentation and displays; communication systems; navigation systems; power generation systems – engine driven alternators, auxiliary power Module, ram air turbine; power conversion, distribution and management.  ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n 1. John D. Anderson, “Introduction to Flight”, McGraw-Hill Education, 2011, ISBN 9780071086059.\n 2. Lalit Gupta and O P Sharma, “Fundamentals of Flight Vol-I to Vol-IV”, Himalayan Books, 2006.\n\n  Reference Books:\n   1. A.C. Kermode, “Flight without formulae”, Pearson Education India, 1989. ISBN:  9788131713891.\n 2. Nelson R.C., “Flight stability and automatic control”, McGraw-Hill International Editions, 1998. ISBN 9780071158381.\n 3. Ian Moir, Allan Seabridge, “Aircraft Systems: Mechanical, Electrical and Avionics Subsystems Integration”, John Wiley & Sons, 2011, ISBN: 978111965006. \n 4. Sutton G.P., “Rocket Propulsion Elements”, John Wiley, New York, 8th Ed., 2011; ISBN: 1118174208, 9781118174203",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17ae32notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
