[{
    "_id": "1040",
    "subcode": "17AE44",
    "subname": "Mechanisms and Machine Theory",
    "m1": "Module 1",
    "m1desc": "Introduction to Mechanisms: \nTypes of constrained motion, Link and its types, joints and its types, kinematic pair and its types, degrees of freedom, Grubler’s criterion, Types of kinematic chains and inversions:  Inversions of Four bar chain: Beam engine, coupling rod of a locomotive, Watt’s indicator mechanism. Inversions of Single Slider Crank Chain: Pendulum pump or Bull engine, Oscillating cylinder engine, Rotary internal combustion engine, Crank and slotted lever quick return motion mechanism, Whitworth quick return motion mechanism. Inversions of Double Slider Crank Chain: Elliptical trammels, Scotch yoke mechanism, Oldham’s coupling. Straight line motion mechanisms: Peaucellier’s mechanism and Robert’s mechanism. Intermittent Motion mechanisms: Geneva wheel mechanism and Ratchet and Pawl mechanism, Ackerman steering gear mechanism.",
    "m2": "Module 2",
    "m2desc": " Velocity, Acceleration and static force analysis of Mechanisms (Graphical Methods): \nVelocity and acceleration analysis of Four Bar mechanism, slider crank mechanism and Simple Mechanisms by vector polygons. \n\nStatic force analysis: \nIntroduction: Static equilibrium, Equilibrium of two and three force members. Members with two forces and torque. Free body diagrams, principle of virtual work. Static force analysis of four bar mechanism and slider-crank mechanism with and without friction.",
    "m3": "Module 3",
    "m3desc": "Spur Gears and Gear Trains Spur Gears: \nGear terminology, law of gearing, Path of contact, Arc of contact, Contact ratio of spur gear, Interference in involute gears, Methods of avoiding interference. \n\nGear Trains: \nSimple gear trains, Compound gear trains, Reverted gear trains, Epicyclic gear trains, Analysis of epicyclic gear train (Algebraic and tabular methods), torques in epicyclic trains",
    "m4": "Module 4",
    "m4desc": "Balancing of Rotating and Reciprocating Masses  Balancing of Rotating Masses: \nBalancing of Several Masses Rotating in the Same Plane, Balancing of Several Masses Rotating in Different Planes (only Graphical Methods). \n\nBalancing of Reciprocating Masses: \nPrimary and Secondary Unbalanced Forces of Reciprocating Masses, Partial Balancing of Unbalanced Primary Force in a Reciprocating Engine, Balancing of Primary and secondary Forces of Multi-cylinder In-line Engines, Balancing of Radial Engines (only Graphical Methods).",
    "m5": "Module 5",
    "m5desc": "Governors and Gyroscope Governors: \nTypes of governors; force analysis of Porter and Hartnell governors, Controlling force, stability, sensitiveness, isochronism, effort and power of Porter and Hartnell governors. \n\nGyroscopes:  \nVectorial representation of angular motion, gyroscopic couple, effect of gyroscopic couple on plane disc and aeroplane.",
    "descname": "Prescribed text books",
    "descdata": "Text Books: \n1. Rattan S.S, “Theory of Machines”, Tata McGraw-Hill Publishing Company Ltd., New Delhi, and 3rd edition -2009, ISBN: 007014477X, 9780070144774. \n2. J.J. Uicker, G.R. Pennock, J.E. Shigley. “Theory of Machines & Mechanisms”, OXFORD 3rd Ed. 2009, ISBN-13: 978-0195371239 \n\nReference Books:  \n1. R. S. Khurmi, J.K. Gupta, “Theory of Machines”, Eurasia Publishing House, 2008, ISBN 13: 9788121925242. \n2. Robert L Norton, “Design of Machinery” by McGraw Hill, 2001, ISBN-13: 978-0077421717. \n3. Ambekar, “Mechanism and Machine theory”, PHI Learning Pvt. Ltd., 2007, ISBN 13: 9788120331341.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
