[{
      "_id": "5ef76c0fbc428605b401fcee",
      "subcode": "17AE34",
      "subname": "Mechanics of Materials",
      "m1": "Module 1",
      "m1desc": "Basic equations of linear elasticity:\n The concept of stress, Analysis of the state of stress at a point, Equilibrium equations, The state of plane stress, The concept of strain, Analysis of the state of strain at a point, Plane strain and plane stress in polar coordinates, Problem featuring cylindrical symmetry.\n\nConstitutive behaviour of materials:\n Constitutive laws for isotropic materials, Allowable stress, Yielding under combined loading, Material selection for structural performance, Composite materials, Constitutive laws for anisotropic materials, Strength of a transversely isotropic lamina.  Engineering structural analysis: Solution approaches, Bar under constant axial force, Pressure vessels.   ",
      "m2": "Module 2",
      "m2desc": "Euler-Bernoulli beam theory:\n The Euler-Bernoulli assumptions, Implications of the Euler-Bernoulli assumptions, Stress resultants Beams subjected to axial loads, Beams subjected to transverse loads, Beams subjected to combined axial and transverse loads.  \n\nThree-dimensional beam theory:\n Kinematic description, Sectional constitutive law, Sectional equilibrium equations, governing equations, Decoupling the three-dimensional problem, The principal centroidal axes of bending. The neutral axis, Evaluation of sectional stiffness.          ",
    "m3": "Module 3",
      "m3desc": "Torsion: \n Torsion of circular cylinders, Torsion combined with axial force and bending moments, Torsion of bars with arbitrary cross sections, Torsion of a thin rectangular cross-section, Torsion of thinwalled open sections. \n\n Thin-walled beams:\n Basic equations for thin-walled beams, Bending of thin-walled beams, Shearing of thin-walled beams. The shear centre. Torsion of thin-walled beams, Coupled bending-torsion problems Warping of thin-walled beams under torsion. Equivalence of the shear and twist centres, Non-uniform torsion, Structural idealization. ",
      "m4": "Module 4",
      "m4desc": " Virtual work principles: \n Introduction, Equilibrium and work fundamentals, Principle of virtual work, Principle of virtual work applied to mechanical systems, Principle of virtual work applied to truss structures.  Principle of complementary virtual work, internal virtual work in beams and solids.  \n\nEnergy methods: \nConservative forces, Principle of minimum total potential energy, Strain energy in springs, Strain energy in beams,  Strain energy in solids,  Applications to trusses, Development of a ﬁnite element formulation for trusses,  Principle of minimum complementary, Energy theorems, Reciprocity theorems, Saint-Venant’s principle.    ",
      "m5": "Module 5",
      "m5desc": "Yielding: \n Yielding under combined loading, Applications of yield criteria to structural, Application to bars, trusses and beams. Buckling of beams: Rigid bar with root torsion spring, buckling of beams, buckling of sandwich beams. Shearing deformations in beams, Shear deformable beams: an energy approach.  \n\n                                                                              Kirchhoff plate theory: \nGoverning equations of Kirchhoff plate theory, The bending problem, Anisotropic plates, Solution techniques for rectangular plates, Circular, Energy formulation of Kirchhoff plate theory, Buckling of plates. ",
      "descname": "Prescribed text books",
      "descdata": " Text Books:  \n1. S.S. Bhavaikatii, “Strength of Materials”, Vikas Publications House, New Delhi, 2012, ISBN13: 978-8125927914. \n2. Timoshenko and Young “Elements of Strength of Materials’, East-West Press, 1976, ISBN 10: 8176710199.  \n\nReference Books: \n  1. Beer. F.P. and Johnston. R, “Mechanics of Materials”, McGraw Hill Publishers, 2006, ISBN-13: 978-0073380285.\n 2. S. Ramamrutham, R Narayanan, “Strength of Materials”, Dhanapath Rai Publishing Company, New Delhi, 2012, ISBN 13: 9789384378264\n 3. Bao Shihua, Gong Yaoqing “Structural Mechanics” Wuhan University of Technology Press, 2005, ISBN: 7562924074 9787562924074 \n4. T.H.G Megson “Introduction to Aircraft Structural Analysis”, Butterworth-Heinemann Publications, 2007, ISBN 13: 9781856179324   ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
