[{
    "_id": "1030",
    "subcode": "17AE43",
    "subname": "Aircraft Propulsion",
    "m1": "Module 1",
    "m1desc": "Introduction: \nReview of thermodynamic principles, Principles of aircraft propulsion, Types of power plants, Working principles of internal combustion engine, Two – stroke and four – stroke piston engines, Gas- turbine engines, Cycle analysis of reciprocating engines and jet engines , advantages and disadvantages.",
    "m2": "Module 2",
    "m2desc": "Propeller Theories & Jet propulsion: \nTypes of propeller, Propeller thrust: momentum theory, Blade element theories, propeller blade design, propeller selection. \n\nJet Propulsion: \nIllustration of working of gas turbine engine – The thrust equation – Factors affecting thrust – Effect of pressure, velocity and temperature changes of air entering compressor – Methods of thrust augmentation – Characteristics of turboprop, turbofan and turbojet – Performance characteristics.",
    "m3": "Module 3",
    "m3desc": "Inlets & Nozzles: \nInternal flow and Stall in Subsonic inlets, Boundary layer separation. Major features of external flow near a subsonic inlet. Relation between minimum area ratio and eternal deceleration ratio. Diffuser performance.  \n\nSupersonic inlets: \nSupersonic inlets, starting problem in supersonic inlets, Shock swallowing by area variation, External deceleration. Modes of inlet operation. \n\nNozzles: \nTheory of flow in isentropic nozzles, Convergent nozzles and nozzle choking, Nozzle throat conditions. Nozzle efficiency, Losses in nozzles. Over-expanded and under-expanded nozzles, Ejector and variable area nozzles, Thrust reversal.",
    "m4": "Module 4",
    "m4desc": "Gas Turbine Engine Compressors  Centrifugal compressors: \nPrinciple of operation of centrifugal compressors. Work done and pressure rise -Velocity diagrams, Diffuser vane design considerations. performance characteristics. Concept of Prewhirl, Rotating stall. \n\nAxial flow compressors:  \nElementary theory of axial flow compressor, Velocity triangles, Degree of reaction, three dimensional flow. Air angle distribution for free vortex and constant reaction designs, Compressor blade design. Axial compressor performance characteristics.",
    "m5": "Module 5",
    "m5desc": "Combustion chambers and Turbines: \nClassification of combustion chambers, important factors affecting combustion chamber design, Combustion process, Combustion chamber performance Effect of operating variables on performance – Flame tube cooling – Flame stabilization – Use of flame holders. \n\nAxial Flow Turbines: \nIntroduction, Turbine stage, Multi-staging of turbine, Exit flow conditions, Turbine cooling, Heat transfer in turbine cooling. \n\nRadial turbine: \nIntroduction, Thermodynamics of radial turbines, Losses and efficiency.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. Bhaskar Roy, “Aircraft propulsion”, Elsevier (2011), ISBN-13: 9788131214213 \n2. V. Ganesan, “Gas Turbines”, Tata McGraw-Hill, 2010, New Delhi, India, ISBN: 0070681929.  \n\nReference Books:  \n1. Hill, P.G. & Peterson, C.R., “Mechanics & Thermodynamics of Propulsion” Addison –        Wesley Longman INC, 1999, ISBN-13: 978-0201146592. \n2. Cohen, H. Rogers, G.F.C. and Saravanamuttoo, H.I.H., “Gas Turbine Theory”, Longman, 1989, ISBN 13: 9780582236325. \n3. Irwin E. Treager, “Gas Turbine Engine Technology” GLENCOE Aviation Technology Series, 7th Edition, Tata McGraw Hill Publishing Co. Ltd.  Print 2003, ISBN-13: 978-0028018287 \n4. S. M. Yahya, “Fundamentals of Compressible Flow with Aircraft and Rocket propulsion”, 4th Edition, New Age International Publications, New Delhi 2014, ISBN 13: 9788122426687.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
