[{
      "_id": "5ef76ca3bc428605b401fcf0",
      "subcode": "17AE36",
      "subname": "Measurement and Metrology",
      "m1": "Module 1",
      "m1desc": "Standards of measurement:  \n Definition and Objectives of metrology, Standards of length - International prototype meter, Imperial standard yard, Wave length standard, subdivision of standards, line and end standard, comparison, transfer from line standard to end standard, calibration of end bars (Numerical), Slip gauges, Wringing phenomena, Indian Standards (M-81, M-112), Numerical problems on building of slip gauges.   ",
      "m2": "Module 2",
      "m2desc": " System of limits, Fits, Tolerances and gauging:\n Definition of tolerance, Specification in assembly, Principle of inter changeability and selective assembly limits of size, Indian standards, concept  of limits of size and tolerances, compound tolerances, accumulation of tolerances, definition of fits, types of fits and their designation (IS 919 -1963), geometrical tolerance, positional - tolerances, hole basis system, shaft basis of system, classification of gauges, brief concept of design of gauges (Taylor's principles), Wear allowance on gauges, Types of gauges -plain plug gauge, ring Gauge, snap gauge, limit gauge and gauge materials.   ",
    "m3": "Module 3",
      "m3desc": "Comparators and Angular measurement:\n  Introduction to Comparator, Characteristics, classification of comparators, mechanical comparators - Sigma Comparators, dial indicator, Optical Comparators principles, Zeiss ultra optimeter, Electric and Electronic Comparators principles, Pneumatic Comparators, back pressure gauges, Solex Comparators. Angular measurements, Bevel Protractor, Sine Principle and. use of Sine bars, Sine center, use of angle gauges, Clinometers,   \n\nScrew thread gear measurement:  \nTerminology of screw threads, measurement of major diameter, minor diameter pitch, angle and effective diameter of screw threads by 2-wire and 3-wire methods, Best size wire. Gear tooth vernier.  ",
      "m4": "Module 4",
      "m4desc": "Measurements and Measurement systems: \n Definition, Significance of measurement, generalized measurement system, definitions and concept of accuracy, precision, calibration, threshold, sensitivity, hysteresis, repeatability, linearity, loading effect, system response-times delay. Errors in Measurements, Classification of Errors. Transducers, Transfer efficiency, Primary and Secondary transducers, electrical, Mechanical, electronic transducers, advantages of each type transducers",
      "m5": "Module 5",
      "m5desc": "Measurement of quantities: \n Principle, analytical balance, platform balance, proving ring, Torque measurement, Prony brake, hydraulic dynamometer.  Pressure Measurements, Principle, use of elastic members, Bridgeman gauge, Mcloed gauge, Pirani Gauge.   \n\nTemperature and strain measurement: \n Resistance thermometers, thermocouple, law of thermocouple, materials used for construction, pyrometer, Optical Pyrometer. Strain Measurements, Strain gauge, preparation and mounting of strain gauges, gauge factor, methods of strain measurement    ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n1. Beckwith Marangoni and Lienhard, John H. Lienhard V “Mechanical Measurements”, 6th Ed., 2006, ISBN-13: 978-0201847659.\n  2. R.K. Jain “Engineering Metrology”, Khanna Publishers, 1994, ISBN 13: 9788174091536 \n\nReference Books:   \n1. I.C. Gupta “Engineering Metrology” Dhanpat Rai Publications, Delhi, 2013, ISBN 13: 1234567144039.\n 2. Alsutko, Jerry. D. Faulk “Industrial Instrumentation”, Thompson Asia Pvt. Ltd.2002, ISBN-13: 978-0827361256    ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
