[{
    "_id": "1060",
    "subcode": "17AE46",
    "subname": "Turbomachines",
    "m1": "Module 1",
    "m1desc": "Introduction to turbomachines:  \nClassification and parts of a turbo machines; comparison with positive displacement machines; dimensionless parameters and their physical significance; specific speed; illustrative examples on dimensional analysis and model studies. \n\nEnergy transfer in turbomachines: \nBasic Euler turbine equation and its alternate form; components of energy transfer; general expression for degree of reaction; construction of velocity triangles for different values of degree of reaction.",
    "m2": "Module 2",
    "m2desc": "Compression process: \nOverall isentropic efficiency of compression; stage efficiency; comparison and relation between overall efficiency and stage efficiency; polytropic efficiency; pre heat factor.\n\nExpansion process: \nOverall isentropic efficiency for a turbine; stage efficiency for a turbine; comparison and relation between stage efficiency and overall efficiency, polytropic efficiency; reheat factor for expansion process.",
    "m3": "Module 3",
    "m3desc": "Design and performance analysis of Centrifugal compressors: \nTypes, design parameters, flow analysis in impeller blades, volutes and diffusers, losses, slip factor, characteristic curves, surging, choking. Construction details. \n\nDesign and performance analysis of axial fans and compressors: \nStage velocity diagrams, enthalpy-entropy diagrams, stage losses and efficiency, work done, simple stage design problems, performance characteristics, instability in axial compressors. Construction details.",
    "m4": "Module 4",
    "m4desc": "Design and performance analysis of axial flow turbines: \nTurbine stage, work done, degree of reaction, losses and efficiency, flow passage; subsonic, transonic and supersonic turbines, multi-staging of turbine; exit flow conditions; turbine cooling \n\nDesign and performance analysis of radial turbines: \nThermodynamics and aerodynamics of radial turbines; radial turbine characteristics; losses and efficiency; design of radial turbine.",
    "m5": "Module 5",
    "m5desc": "Hydraulic pumps: \nCentrifugal and axial pumps. Manometric head, suction head, delivery head; manometric efficiency, hydraulic efficiency, volumetric efficiency, overall efficiency; multi stage pumps. Characteristics of pumps. \n\nHydraulic turbines: \nClassification; Module quantities; Pelton wheel, Francis turbine, Kaplan turbine and their velocity triangles. Draft tubes and their function. Characteristics of hydraulic turbines.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. S.M. Yahya, “Turbines, Compressors & Fans”, Tata-McGraw Hill Co., 2nd Edition (2002), ISBN 13: 9780070707023. \n2. D.G. Shephered, “Principles of Turbo Machinery”, The Macmillan Company (1964), ISBN-13: 978-0024096609. \n\nReference Books: \n1. V. Kadambi and Manohar Prasad, “An introduction to Energy conversion, Volume III, Turbo machinery “, Wiley Eastern Ltd, 1977, ISBN: 9780852264539.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
