[{
      "_id": "5ef76c57bc428605b401fcef",
      "subcode": "17AE35 ",
      "subname": "Mechanics of Fluid",
      "m1": "Module 1",
      "m1desc": "Basic Considerations:  \n   Introduction, Dimensions- Modules and physical quantities, Continuum view of gases and liquids, Pressure and Temperature scales, Physical properties of fluids.   \n\nFluid Statics:\n Pressure distribution in a static fluid, Pressure and its measurement, hydrostatic forces on plane and curved surfaces, buoyancy, illustration by examples.   ",
      "m2": "Module 2",
      "m2desc": "Fluids in motion:\n Methods of describing fluid motion, types of fluid flow, continuity equation in 3 dimensions, velocity potential function and stream function. Types of motion, Source   sink, doublet, plotting of stream lines and potential lines Numerical problems. \n\n  Fluid Kinematics:\n Kinematics of fluid motion and the constitutive equations, Integral (global) form of conservation equations (mass, momentum, energy) and applications, Differential form of conservation equations (continuity, Navier-Stokes equations, energy equation). ",
     "m3": "Module 3",
      "m3desc": "Fluid Dynamics:  \n Equations of motion: Euler’s and Bernoulli’s equation of motion for ideal and real fluids. Momentum equation, Fluid flow measurements. Numerical problems\n\nDimensional analysis and similarity:\n Dimensional homogeneity, methods of dimensional analysis, model analysis, types of similarity and similitude. Dimensionless numbers. Model laws. Numerical problems. ",
      "m4": "Module 4",
      "m4desc": " Flow past Immersed bodies: \n Introduction to boundary layer, boundary layer thickness, karman’s integral momentum theory, drag on a flat plate for laminar and turbulent flow, Drag on immersed bodies. Expression for drag and lift.   Kutta – joukowsky theorem; Fundamentals of aerofoil theory Numerical problems.  ",
      "m5": "Module 5",
      "m5desc": "Compressible flow and Boundary Layers theory:\n  Steady, one-dimensional gas dynamics, Propagation of pressure waves in a compressible medium, velocity of sound, Mach number, Mach cone, Stagnation properties, Bernoulli’s eqn for isentropic flow, normal shock waves. Numerical Problem; Laminar and turbulent boundary layers.  ",
      "descname": "Prescribed text books",
      "descdata": " Text Books:  \n1. Bansal, R.K, “Fluid Mechanics and Hydraulics Machines”, Laxmi Publications (P) Ltd., New Delhi 2015, ISBN-13: 978-8131808153. \n2. Rathakrishnan. E, “Fluid Mechanics”, Prentice-Hall of India Pvt. Ltd, 2010, ISBN 13: 9788120331839. \n\nReference Books:   \n1. Yunus A. Cengel & John M Cimbala, Fluid Mechanics and Applications, McGraw Hill Education; 3rd edition, 2013, ISBN-13: 978-0073380322. \n2. Ramamritham. S “Hydraulic Fluid Mechanics and Fluid Machines”, Dhanpat Rai& Sons,    Delhi, 1988, ISBN 13: 9788187433804.\n  3. Kumar. K.L., “Engineering Fluid Mechanics” (VII Ed.) Eurasia Publishing House (P) Ltd., New Delhi, 1995, ISBN 13: 9788121901000. \n 4. Streeter. V. L., and Wylie, E.B., “Fluid Mechanics”, McGraw Hill, 1983, ISBN 13: 9780070665781   ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
