[{
      "_id": "5ef76b5abc428605b401fced",
      "subcode": "17AE33 ",
      "subname": "Aerothermodynamics",
      "m1": "Module 1",
      "m1desc": "Fundamental Concepts & Definitions:\n Thermodynamics definition and scope, Microscopic and Macroscopic approaches. Some practical applications of engineering thermodynamic Systems, Characteristics of system boundary and control surface, examples. Thermodynamic properties; definition and Modules, intensive and extensive properties. Thermodynamic state, state point, state diagram, path and process, quasi-static process, cyclic and noncyclic processes; Thermodynamic equilibrium; definition, mechanical equilibrium; diathermic wall, thermal equilibrium, chemical equilibrium. Zeroth law of thermodynamics, Temperature; concepts, scales, fixed points and measurements. \n\nWork and Heat:\n Mechanics-definition of work and its limitations. Thermodynamic definition of work; examples, sign convention. Displacement work; as a part of a system boundary, as a whole of a system boundary, expressions for displacement work in various processes through p-v diagrams. Shaft work; Electrical work. Other types of work. Heat ",
      "m2": "Module 2",
      "m2desc": "First Law of Thermodynamics:\n Joules experiments, equivalence of heat and work. Statement of the First law of thermodynamics, extension of the First law to non - cyclic processes, energy, energy as a property, modes of energy, pure substance; definition, two-property rule, Specific heat at constant volume, enthalpy, specific heat at constant pressure. Extension of the First law to control volume; steady state-steady flow energy equation, important applications, analysis of unsteady processes such as film and evacuation of vessels with and without heat transfer",
    "m3": "Module 3",
      "m3desc": "Second Law of Thermodynamics: \n Devices converting heat to work; (a) in a thermodynamic cycle, (b) in a mechanical cycle. Thermal reservoir. Direct heat engine; schematic representation and efficiency. Devices converting work to heat in a thermodynamic cycle; reversed heat engine, schematic representation, coefficients of performance. Kelvin - Planck statement of the Second law of Thermodynamics; PMM I and PMM II, Clausius statement of Second law of Thermodynamics, Equivalence of the two statements; Reversible and Irreversible processes; factors that make a process irreversible, reversible heat engines, Carnot cycle, Carnot principles.\n\nEntropy:\n Clasius inequality; Statement, proof, application to a reversible cycle. Entropy; definition, a property, change of entropy, principle of increase in entropy, entropy as a quantitative test for irreversibility, calculation of entropy using Tds relations, entropy as a coordinate. Available and unavailable energy.   ",
      "m4": "Module 4",
      "m4desc": "Pure Substances & Ideal Gases: \n Mixture of ideal gases and real gases, ideal gas equation, compressibility factor use of charts. P-T and P-V diagrams, triple point and critical points. Sub-cooled liquid, Saturated liquid, mixture of saturated liquid and vapour, saturated vapour and superheated vapour states of pure substance with water as example. Enthalpy of change of phase (Latent heat). Dryness fraction (quality), TS and H-S diagrams, representation of various processes on these diagrams.  \n\nThermodynamic relations\n  Maxwells equations, Tds relations, ratio of heat capacities, evaluation of thermodynamic properties from an equation of state  ",
      "m5": "Module 5",
      "m5desc": "Gas Cycles: \n Efficiency of air standard cycles, Carnot, Otto, Diesel cycles, P-V & T-S diagram, calculation of efficiency; Carnot vapour power cycle, simple Rankine cycle, Analysis and performance of Rankine Cycle, Ideal and practical regenerative Rankine cycles – Reheat and Regenerative Cycles, Binary vapour cycle.   ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n 1. A Venkatesh, “Basic Engineering Thermodynamics”, Universities Press, India, 2007, ISBN 13: 9788173715877  \n2. P K Nag, “Basic and Applied Thermodynamics”, 2nd Ed., Tata McGraw Hill Pub. 2002, ISBN 13: 9780070151314  \n\nReference Books:\n   1. Yunus A. Cenegal and Michael A. Boles, “Thermodynamics: An Engineering Approach”, Tata McGraw Hill publications, 2002, ISBN 13: 9780071072540 \n 2. J.B. Jones and G.A. Hawkins, John Wiley and Sons, “Engineering Thermodynamics”, Wiley 1986, ISBN 13: 9780471812029 \n3. G.J. Van Wylen and R.E. Sonntag, “Fundamentals of Classical Thermodynamics”, Wiley Eastern, Wiley, 1985, ISBN 13: 9780471800149  \n4. Y.V.C. Rao, “An Introduction to Thermodynamics”, Wiley Eastern, 1993, ISBN 13: 9788173714610.\n 5. B.K Venkanna, Swati B. Wadavadagi “Basic Thermodynamics”, PHI, New Delhi, 2010, ISBN 13: 978-8120341128.  ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17ae33notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
