[{
      "_id": "5ef768fd2c5a1e0c0ca7ffff",
      "subcode": "17MAT31",
      "subname": "Engineering Mathematics-III",
      "m1": "Module 1",
      "m1desc": "Fourier Series: \n Periodic functions, Dirichlet’s condition, Fourier Series of periodic functions with period 2π and with arbitrary period 2c. Fourier series of even and odd functions. Half range Fourier Series, practical harmonic Analysis-Illustrative examples from engineering field.  ",
      "m2": "Module 2",
      "m2desc": "Fourier Transforms:\n Infinite Fourier transforms, Fourier sine and cosine transforms. Inverse Fourier transform.\n\n  Z-transform: \nDifference equations, basic definition, z-transform definition, Standard z-transforms, Damping rule, Shifting rule, Initial value and final value theorems (without proof) and problems, Inverse ztransform. Applications of z-transforms to solve difference equations. ",
    "m3": "Module 3",
      "m3desc": "Statistical Methods: \n Review of measures of central tendency and dispersion. CorrelationKarl Pearson’s coefficient of correlation-problems. Regression analysis- lines of regression (without proof) –problems Curve Fitting: Curve fitting by the method of least squares- fitting of the curves of the form, y= ax + b, y = ax2+ bx + c and y = aebx. Numerical Methods: Numerical solution of algebraic and transcendental equations by Regula- Falsi Method and Newton-Raphson method. ",
      "m4": "Module 4",
      "m4desc": "Finite differences:\n Forward and backward differences, Newton’s forward and backward interpolation formulae. Divided differences- \nNewton’s divided difference formula. Lagrange’s interpolation formula and inverse interpolation formula (all formulae without proof)- problems.  Numerical integration: Simpson’s (1/3)th and (3/8)th rules, Weddle’s rule (without proof ) – Problems.   ",
      "m5": "Module 5",
      "m5desc": "Vector integration: \n Line integrals-definition and problems, surface  and volume integrals-definition, Green’s theorem in a plane, Stoke s and Gauss-divergence theorem (without proof) and problems.  Calculus of Variations: Variation of function and Functional, variational  problems. Euler’s equation, Geodesics, hanging chain, problems.   ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:\n 1. B.S. Grewal: Higher Engineering Mathematics, Khanna Publishers, 43rd Ed., 2015.  \n 2. E. Kreyszig: Advanced Engineering Mathematics, John Wiley & Sons, 10th Ed., 2015.\n\n   Reference Books:\n   1. N.P. Bali and Manish Goyal: A Text Book of Engineering Mathematics, Laxmi Publishers, 7th Ed., 2010.\n 2. B.V. Ramana: Higher Engineering Mathematics Tata McGraw-Hill, 2006.\n 3. H. K. Dass and Er. RajnishVerma: Higher Engineering Mathematics, S. Chand publishing, 1st edition, 2011.  ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17mat31notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
