[{
    "_id": "1010",
    "subcode": "17MAT41",
    "subname": "Engineering Mathematics-IV",
    "m1": "Module 1",
    "m1desc": "Numerical Methods: \nNumerical solution of ordinary differential equations of first order and first degree, Picard’s method, Taylor’s series method, modified Euler’s method, Runge - Kutta method of fourth order. Milne’s and Adams-Bashforth predictor and corrector methods (No derivations of formulae). Numerical solution of simultaneous first order ordinary differential equations, Picard’s method, Runge-Kutta method of fourth order",
    "m2": "Module 2",
    "m2desc": "Numerical Methods: \nNumerical solution of second order ordinary differential equations, Picard’s method, Runge-Kutta method and Milne’s method \n\nSpecial Functions: \nBessel’s functions-  basic properties, recurrence relations, orthogonality and generating functions. Legendre’s functions -   Legendre’s polynomial, Rodrigue’s formula, problems.",
    "m3": "Module 3",
    "m3desc": "Complex Variables: \nFunction of a complex variable, limits, continuity, differentiability, Analytic Functions-Cauchy-Riemann equations in Cartesian and polar forms. Properties and construction of analytic functions. Complex line Integrals-Cauchy’s theorem and Cauchy’s integral formula, Residue, poles, Cauchy’s Residue theorem with proof and problems. \n\n Transformations: \nConformal transformations, discussion of transformations:  and bilinear transformations.",
    "m4": "Module 4",
    "m4desc": "Probability Distributions: \nRandom variables (discrete and continuous), probability functions. Binomial distribution, Poisson distribution, geometric distribution, uniform distribution, Exponential and normal distributions, Problems.\n\nJoint probability distribution: \nJoint Probability distribution for two variables, expectation, covariance, correlation coefficient.",
    "m5": "Module 5",
    "m5desc": "Sampling Theory:  \nSampling, Sampling distributions, standard error, test of hypothesis for means and proportions, confidence limits for means, student’s t-distribution, Chi-square distribution as a test of goodness of fit. \n\nStochastic process:  \nStochastic process, probability vector, stochastic matrices, fixed points, regular stochastic matrices, Markov chains, higher transition probability",
    "descname": "Prescribed text books",
    "descdata": "TEXT BOOKS: \n1. B.V. Ramana Higher Engineering Mathematics Tata Mc Graw-Hill, 2006 \n2. B.S. Grewal – Higher Engineering Mathematics, Khanna Publishers, 42nd Edition, 2013.\n\nREFERENCE BOOKS: \n1. N P. Bali and Manish Goyal, A text book of Engineering mathematics, Laxmi publications, latest edition.  \n2. Kreyszig, Advanced Engineering Mathematics -   9th edition, Wiley, 2013. \n3. H. K Dass and Rajnish Verma,Higher Engineering Mathematics, S. Chand publishing, 1st edition, 2011.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
