[{
  "semno":"Semester 3",
  "branchname":"Aeronoutic Engineering",
  "subjno":"6",
  "labno":"2",
  "url": "https://adityam945.github.io/aero-json-files/",
   "subj1":"Engineering Mathematics-III",
   "subj1code": "17MAT31",
   "subj2":"Elements of Aeronautics",
   "subj2code": "17AE32",
   "subj3":"Aerothermodynamics",
   "subj3code": "17AE33",
   "subj4":"Mechanics of Materials",
   "subj4code": "17AE34",
   "subj5":"Mechanics of Fluid",
   "subj5code": "17AE35",
   "subj6":"Measurement and Metrology",
   "subj6code": "17AE36",
   "labname1":"MEASUREMENT AND METROLOGY LAB",
   "lab1code":"17AEL37A",
   "labname2":"MACHINE SHOP LAB ",
   "lab2code":"17AEL38",

  "subj1data":[{
      "_id": "5ef768fd2c5a1e0c0ca7ffff",
      "subcode": "17MAT31",
      "subname": "Engineering Mathematics-III",
      "m1": "Module 1",
      "m1desc": "Fourier Series: \n Periodic functions, Dirichlet’s condition, Fourier Series of periodic functions with period 2π and with arbitrary period 2c. Fourier series of even and odd functions. Half range Fourier Series, practical harmonic Analysis-Illustrative examples from engineering field.  ",
      "m2": "Module 2",
      "m2desc": "Fourier Transforms:\n Infinite Fourier transforms, Fourier sine and cosine transforms. Inverse Fourier transform.\n\n  Z-transform: \nDifference equations, basic definition, z-transform definition, Standard z-transforms, Damping rule, Shifting rule, Initial value and final value theorems (without proof) and problems, Inverse ztransform. Applications of z-transforms to solve difference equations. ",
    "m3": "Module 3",
      "m3desc": "Statistical Methods: \n Review of measures of central tendency and dispersion. CorrelationKarl Pearson’s coefficient of correlation-problems. Regression analysis- lines of regression (without proof) –problems Curve Fitting: Curve fitting by the method of least squares- fitting of the curves of the form, y= ax + b, y = ax2+ bx + c and y = aebx. Numerical Methods: Numerical solution of algebraic and transcendental equations by Regula- Falsi Method and Newton-Raphson method. ",
      "m4": "Module 4",
      "m4desc": "Finite differences:\n Forward and backward differences, Newton’s forward and backward interpolation formulae. Divided differences- \nNewton’s divided difference formula. Lagrange’s interpolation formula and inverse interpolation formula (all formulae without proof)- problems.  Numerical integration: Simpson’s (1/3)th and (3/8)th rules, Weddle’s rule (without proof ) – Problems.   ",
      "m5": "Module 5",
      "m5desc": "Vector integration: \n Line integrals-definition and problems, surface  and volume integrals-definition, Green’s theorem in a plane, Stoke s and Gauss-divergence theorem (without proof) and problems.  Calculus of Variations: Variation of function and Functional, variational  problems. Euler’s equation, Geodesics, hanging chain, problems.   ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:\n 1. B.S. Grewal: Higher Engineering Mathematics, Khanna Publishers, 43rd Ed., 2015.  \n 2. E. Kreyszig: Advanced Engineering Mathematics, John Wiley & Sons, 10th Ed., 2015.\n\n   Reference Books:\n   1. N.P. Bali and Manish Goyal: A Text Book of Engineering Mathematics, Laxmi Publishers, 7th Ed., 2010.\n 2. B.V. Ramana: Higher Engineering Mathematics Tata McGraw-Hill, 2006.\n 3. H. K. Dass and Er. RajnishVerma: Higher Engineering Mathematics, S. Chand publishing, 1st edition, 2011.  ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17mat31notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }],

  "subj2data":[{
      "_id": "5ef76adabc428605b401fcec",
      "subcode": "17AE32",
      "subname": "Elements of Aeronautics",
      "m1": "Module 1",
      "m1desc": "Introduction to Aircrafts History of aviation; \n Atmosphere and its properties; Classification of aircrafts; Basic components of an aircraft; structural members; aircraft axis system; aircraft motions; control surfaces and high lift devices; classification of aircraft; conventional design configurations; principle of operation of each major part; Helicopters, their parts and functions. \n\n Aircraft Structures and Materials: \n    Introduction; general types of construction; monocoque, semimonocoque and geodesic structures; typical wing and fuselage structure; metallic and non-metallic materials for aircraft application. ",
      "m2": "Module 2",
      "m2desc": "Basic principles of flight –\n significance of speed of sound; airspeed and groundspeed; standard atmosphere; Bernoulli’s theorem and its application for generation of lift and measurement of airspeed; forces over wing section, aerofoil nomenclature, pressure distribution over a wing section. Lift and drag components – generation of lift and drag; lift curve, drag curve, types of drag, factors affecting lift and drag; centre of pressure and its significance; aerodynamic centre, aspect ratio, Mach number and supersonic flight effects; simple problems on lift and drag",
    "m3": "Module 3",
      "m3desc": "Aircraft Propulsion: \n Aircraft power plants, classification based on power plant and location and principle of operation. Turboprop, turbojet and turbofan engines; ramjets and scramjets; performance characteristics. Aircraft power plants – basic principles of piston, turboprop and jet engines;  ",
      "m4": "Module 4",
      "m4desc": "Aircraft Stability:\n Forces on an aircraft in flight; static and dynamic stability; longitudinal, lateral and roll stability; necessary conditions for longitudinal stability; basics of aircraft control systems. Effect of flaps and stats on lift, control tabs, stalling, gliding, landing, turning, aircraft manoeuvres; stalling, gliding, turning. Simple problems on these. Performance of aircraft – power curves, maximum and minimum speeds for horizontal flight at a given altitude; effect of changes in engine power and altitude on performance; correct and incorrect angles of bank; aerobatics, inverted manoeuvre, manoeuvrability. Simple problems. ",
      "m5": "Module 5",
      "m5desc": "Aircraft Systems:  \n Mechanical systems and their components; hydraulic and pneumatic systems; oxygen System; environmental Control System; fuel system. Electrical systems, flight deck and cockpit systems; navigation system, communication system. \n\n  Aircraft systems (Mechanical) – \nhydraulic and pneumatic systems and their applications; environment control system; fuel system, oxygen system.  \n\n Aircraft systems (Electrical) – \n flight control system, cockpit instrumentation and displays; communication systems; navigation systems; power generation systems – engine driven alternators, auxiliary power Module, ram air turbine; power conversion, distribution and management.  ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n 1. John D. Anderson, “Introduction to Flight”, McGraw-Hill Education, 2011, ISBN 9780071086059.\n 2. Lalit Gupta and O P Sharma, “Fundamentals of Flight Vol-I to Vol-IV”, Himalayan Books, 2006.\n\n  Reference Books:\n   1. A.C. Kermode, “Flight without formulae”, Pearson Education India, 1989. ISBN:  9788131713891.\n 2. Nelson R.C., “Flight stability and automatic control”, McGraw-Hill International Editions, 1998. ISBN 9780071158381.\n 3. Ian Moir, Allan Seabridge, “Aircraft Systems: Mechanical, Electrical and Avionics Subsystems Integration”, John Wiley & Sons, 2011, ISBN: 978111965006. \n 4. Sutton G.P., “Rocket Propulsion Elements”, John Wiley, New York, 8th Ed., 2011; ISBN: 1118174208, 9781118174203",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17ae32notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }],

  "subj3data":[{
      "_id": "5ef76b5abc428605b401fced",
      "subcode": "17AE33 ",
      "subname": "Aerothermodynamics",
      "m1": "Module 1",
      "m1desc": "Fundamental Concepts & Definitions:\n Thermodynamics definition and scope, Microscopic and Macroscopic approaches. Some practical applications of engineering thermodynamic Systems, Characteristics of system boundary and control surface, examples. Thermodynamic properties; definition and Modules, intensive and extensive properties. Thermodynamic state, state point, state diagram, path and process, quasi-static process, cyclic and noncyclic processes; Thermodynamic equilibrium; definition, mechanical equilibrium; diathermic wall, thermal equilibrium, chemical equilibrium. Zeroth law of thermodynamics, Temperature; concepts, scales, fixed points and measurements. \n\nWork and Heat:\n Mechanics-definition of work and its limitations. Thermodynamic definition of work; examples, sign convention. Displacement work; as a part of a system boundary, as a whole of a system boundary, expressions for displacement work in various processes through p-v diagrams. Shaft work; Electrical work. Other types of work. Heat ",
      "m2": "Module 2",
      "m2desc": "First Law of Thermodynamics:\n Joules experiments, equivalence of heat and work. Statement of the First law of thermodynamics, extension of the First law to non - cyclic processes, energy, energy as a property, modes of energy, pure substance; definition, two-property rule, Specific heat at constant volume, enthalpy, specific heat at constant pressure. Extension of the First law to control volume; steady state-steady flow energy equation, important applications, analysis of unsteady processes such as film and evacuation of vessels with and without heat transfer",
    "m3": "Module 3",
      "m3desc": "Second Law of Thermodynamics: \n Devices converting heat to work; (a) in a thermodynamic cycle, (b) in a mechanical cycle. Thermal reservoir. Direct heat engine; schematic representation and efficiency. Devices converting work to heat in a thermodynamic cycle; reversed heat engine, schematic representation, coefficients of performance. Kelvin - Planck statement of the Second law of Thermodynamics; PMM I and PMM II, Clausius statement of Second law of Thermodynamics, Equivalence of the two statements; Reversible and Irreversible processes; factors that make a process irreversible, reversible heat engines, Carnot cycle, Carnot principles.\n\nEntropy:\n Clasius inequality; Statement, proof, application to a reversible cycle. Entropy; definition, a property, change of entropy, principle of increase in entropy, entropy as a quantitative test for irreversibility, calculation of entropy using Tds relations, entropy as a coordinate. Available and unavailable energy.   ",
      "m4": "Module 4",
      "m4desc": "Pure Substances & Ideal Gases: \n Mixture of ideal gases and real gases, ideal gas equation, compressibility factor use of charts. P-T and P-V diagrams, triple point and critical points. Sub-cooled liquid, Saturated liquid, mixture of saturated liquid and vapour, saturated vapour and superheated vapour states of pure substance with water as example. Enthalpy of change of phase (Latent heat). Dryness fraction (quality), TS and H-S diagrams, representation of various processes on these diagrams.  \n\nThermodynamic relations\n  Maxwells equations, Tds relations, ratio of heat capacities, evaluation of thermodynamic properties from an equation of state  ",
      "m5": "Module 5",
      "m5desc": "Gas Cycles: \n Efficiency of air standard cycles, Carnot, Otto, Diesel cycles, P-V & T-S diagram, calculation of efficiency; Carnot vapour power cycle, simple Rankine cycle, Analysis and performance of Rankine Cycle, Ideal and practical regenerative Rankine cycles – Reheat and Regenerative Cycles, Binary vapour cycle.   ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n 1. A Venkatesh, “Basic Engineering Thermodynamics”, Universities Press, India, 2007, ISBN 13: 9788173715877  \n2. P K Nag, “Basic and Applied Thermodynamics”, 2nd Ed., Tata McGraw Hill Pub. 2002, ISBN 13: 9780070151314  \n\nReference Books:\n   1. Yunus A. Cenegal and Michael A. Boles, “Thermodynamics: An Engineering Approach”, Tata McGraw Hill publications, 2002, ISBN 13: 9780071072540 \n 2. J.B. Jones and G.A. Hawkins, John Wiley and Sons, “Engineering Thermodynamics”, Wiley 1986, ISBN 13: 9780471812029 \n3. G.J. Van Wylen and R.E. Sonntag, “Fundamentals of Classical Thermodynamics”, Wiley Eastern, Wiley, 1985, ISBN 13: 9780471800149  \n4. Y.V.C. Rao, “An Introduction to Thermodynamics”, Wiley Eastern, 1993, ISBN 13: 9788173714610.\n 5. B.K Venkanna, Swati B. Wadavadagi “Basic Thermodynamics”, PHI, New Delhi, 2010, ISBN 13: 978-8120341128.  ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "17ae33notes.json",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }],

  "subj4data":[{
      "_id": "5ef76c0fbc428605b401fcee",
      "subcode": "17AE34",
      "subname": "Mechanics of Materials",
      "m1": "Module 1",
      "m1desc": "Basic equations of linear elasticity:\n The concept of stress, Analysis of the state of stress at a point, Equilibrium equations, The state of plane stress, The concept of strain, Analysis of the state of strain at a point, Plane strain and plane stress in polar coordinates, Problem featuring cylindrical symmetry.\n\nConstitutive behaviour of materials:\n Constitutive laws for isotropic materials, Allowable stress, Yielding under combined loading, Material selection for structural performance, Composite materials, Constitutive laws for anisotropic materials, Strength of a transversely isotropic lamina.  Engineering structural analysis: Solution approaches, Bar under constant axial force, Pressure vessels.   ",
      "m2": "Module 2",
      "m2desc": "Euler-Bernoulli beam theory:\n The Euler-Bernoulli assumptions, Implications of the Euler-Bernoulli assumptions, Stress resultants Beams subjected to axial loads, Beams subjected to transverse loads, Beams subjected to combined axial and transverse loads.  \n\nThree-dimensional beam theory:\n Kinematic description, Sectional constitutive law, Sectional equilibrium equations, governing equations, Decoupling the three-dimensional problem, The principal centroidal axes of bending. The neutral axis, Evaluation of sectional stiffness.          ",
    "m3": "Module 3",
      "m3desc": "Torsion: \n Torsion of circular cylinders, Torsion combined with axial force and bending moments, Torsion of bars with arbitrary cross sections, Torsion of a thin rectangular cross-section, Torsion of thinwalled open sections. \n\n Thin-walled beams:\n Basic equations for thin-walled beams, Bending of thin-walled beams, Shearing of thin-walled beams. The shear centre. Torsion of thin-walled beams, Coupled bending-torsion problems Warping of thin-walled beams under torsion. Equivalence of the shear and twist centres, Non-uniform torsion, Structural idealization. ",
      "m4": "Module 4",
      "m4desc": " Virtual work principles: \n Introduction, Equilibrium and work fundamentals, Principle of virtual work, Principle of virtual work applied to mechanical systems, Principle of virtual work applied to truss structures.  Principle of complementary virtual work, internal virtual work in beams and solids.  \n\nEnergy methods: \nConservative forces, Principle of minimum total potential energy, Strain energy in springs, Strain energy in beams,  Strain energy in solids,  Applications to trusses, Development of a ﬁnite element formulation for trusses,  Principle of minimum complementary, Energy theorems, Reciprocity theorems, Saint-Venant’s principle.    ",
      "m5": "Module 5",
      "m5desc": "Yielding: \n Yielding under combined loading, Applications of yield criteria to structural, Application to bars, trusses and beams. Buckling of beams: Rigid bar with root torsion spring, buckling of beams, buckling of sandwich beams. Shearing deformations in beams, Shear deformable beams: an energy approach.  \n\n                                                                              Kirchhoff plate theory: \nGoverning equations of Kirchhoff plate theory, The bending problem, Anisotropic plates, Solution techniques for rectangular plates, Circular, Energy formulation of Kirchhoff plate theory, Buckling of plates. ",
      "descname": "Prescribed text books",
      "descdata": " Text Books:  \n1. S.S. Bhavaikatii, “Strength of Materials”, Vikas Publications House, New Delhi, 2012, ISBN13: 978-8125927914. \n2. Timoshenko and Young “Elements of Strength of Materials’, East-West Press, 1976, ISBN 10: 8176710199.  \n\nReference Books: \n  1. Beer. F.P. and Johnston. R, “Mechanics of Materials”, McGraw Hill Publishers, 2006, ISBN-13: 978-0073380285.\n 2. S. Ramamrutham, R Narayanan, “Strength of Materials”, Dhanapath Rai Publishing Company, New Delhi, 2012, ISBN 13: 9789384378264\n 3. Bao Shihua, Gong Yaoqing “Structural Mechanics” Wuhan University of Technology Press, 2005, ISBN: 7562924074 9787562924074 \n4. T.H.G Megson “Introduction to Aircraft Structural Analysis”, Butterworth-Heinemann Publications, 2007, ISBN 13: 9781856179324   ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }],

  "subj5data":[{
      "_id": "5ef76c57bc428605b401fcef",
      "subcode": "17AE35 ",
      "subname": "Mechanics of Fluid",
      "m1": "Module 1",
      "m1desc": "Basic Considerations:  \n   Introduction, Dimensions- Modules and physical quantities, Continuum view of gases and liquids, Pressure and Temperature scales, Physical properties of fluids.   \n\nFluid Statics:\n Pressure distribution in a static fluid, Pressure and its measurement, hydrostatic forces on plane and curved surfaces, buoyancy, illustration by examples.   ",
      "m2": "Module 2",
      "m2desc": "Fluids in motion:\n Methods of describing fluid motion, types of fluid flow, continuity equation in 3 dimensions, velocity potential function and stream function. Types of motion, Source   sink, doublet, plotting of stream lines and potential lines Numerical problems. \n\n  Fluid Kinematics:\n Kinematics of fluid motion and the constitutive equations, Integral (global) form of conservation equations (mass, momentum, energy) and applications, Differential form of conservation equations (continuity, Navier-Stokes equations, energy equation). ",
     "m3": "Module 3",
      "m3desc": "Fluid Dynamics:  \n Equations of motion: Euler’s and Bernoulli’s equation of motion for ideal and real fluids. Momentum equation, Fluid flow measurements. Numerical problems\n\nDimensional analysis and similarity:\n Dimensional homogeneity, methods of dimensional analysis, model analysis, types of similarity and similitude. Dimensionless numbers. Model laws. Numerical problems. ",
      "m4": "Module 4",
      "m4desc": " Flow past Immersed bodies: \n Introduction to boundary layer, boundary layer thickness, karman’s integral momentum theory, drag on a flat plate for laminar and turbulent flow, Drag on immersed bodies. Expression for drag and lift.   Kutta – joukowsky theorem; Fundamentals of aerofoil theory Numerical problems.  ",
      "m5": "Module 5",
      "m5desc": "Compressible flow and Boundary Layers theory:\n  Steady, one-dimensional gas dynamics, Propagation of pressure waves in a compressible medium, velocity of sound, Mach number, Mach cone, Stagnation properties, Bernoulli’s eqn for isentropic flow, normal shock waves. Numerical Problem; Laminar and turbulent boundary layers.  ",
      "descname": "Prescribed text books",
      "descdata": " Text Books:  \n1. Bansal, R.K, “Fluid Mechanics and Hydraulics Machines”, Laxmi Publications (P) Ltd., New Delhi 2015, ISBN-13: 978-8131808153. \n2. Rathakrishnan. E, “Fluid Mechanics”, Prentice-Hall of India Pvt. Ltd, 2010, ISBN 13: 9788120331839. \n\nReference Books:   \n1. Yunus A. Cengel & John M Cimbala, Fluid Mechanics and Applications, McGraw Hill Education; 3rd edition, 2013, ISBN-13: 978-0073380322. \n2. Ramamritham. S “Hydraulic Fluid Mechanics and Fluid Machines”, Dhanpat Rai& Sons,    Delhi, 1988, ISBN 13: 9788187433804.\n  3. Kumar. K.L., “Engineering Fluid Mechanics” (VII Ed.) Eurasia Publishing House (P) Ltd., New Delhi, 1995, ISBN 13: 9788121901000. \n 4. Streeter. V. L., and Wylie, E.B., “Fluid Mechanics”, McGraw Hill, 1983, ISBN 13: 9780070665781   ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }],

  "subj6data":[{
      "_id": "5ef76ca3bc428605b401fcf0",
      "subcode": "17AE36",
      "subname": "Measurement and Metrology",
      "m1": "Module 1",
      "m1desc": "Standards of measurement:  \n Definition and Objectives of metrology, Standards of length - International prototype meter, Imperial standard yard, Wave length standard, subdivision of standards, line and end standard, comparison, transfer from line standard to end standard, calibration of end bars (Numerical), Slip gauges, Wringing phenomena, Indian Standards (M-81, M-112), Numerical problems on building of slip gauges.   ",
      "m2": "Module 2",
      "m2desc": " System of limits, Fits, Tolerances and gauging:\n Definition of tolerance, Specification in assembly, Principle of inter changeability and selective assembly limits of size, Indian standards, concept  of limits of size and tolerances, compound tolerances, accumulation of tolerances, definition of fits, types of fits and their designation (IS 919 -1963), geometrical tolerance, positional - tolerances, hole basis system, shaft basis of system, classification of gauges, brief concept of design of gauges (Taylor's principles), Wear allowance on gauges, Types of gauges -plain plug gauge, ring Gauge, snap gauge, limit gauge and gauge materials.   ",
    "m3": "Module 3",
      "m3desc": "Comparators and Angular measurement:\n  Introduction to Comparator, Characteristics, classification of comparators, mechanical comparators - Sigma Comparators, dial indicator, Optical Comparators principles, Zeiss ultra optimeter, Electric and Electronic Comparators principles, Pneumatic Comparators, back pressure gauges, Solex Comparators. Angular measurements, Bevel Protractor, Sine Principle and. use of Sine bars, Sine center, use of angle gauges, Clinometers,   \n\nScrew thread gear measurement:  \nTerminology of screw threads, measurement of major diameter, minor diameter pitch, angle and effective diameter of screw threads by 2-wire and 3-wire methods, Best size wire. Gear tooth vernier.  ",
      "m4": "Module 4",
      "m4desc": "Measurements and Measurement systems: \n Definition, Significance of measurement, generalized measurement system, definitions and concept of accuracy, precision, calibration, threshold, sensitivity, hysteresis, repeatability, linearity, loading effect, system response-times delay. Errors in Measurements, Classification of Errors. Transducers, Transfer efficiency, Primary and Secondary transducers, electrical, Mechanical, electronic transducers, advantages of each type transducers",
      "m5": "Module 5",
      "m5desc": "Measurement of quantities: \n Principle, analytical balance, platform balance, proving ring, Torque measurement, Prony brake, hydraulic dynamometer.  Pressure Measurements, Principle, use of elastic members, Bridgeman gauge, Mcloed gauge, Pirani Gauge.   \n\nTemperature and strain measurement: \n Resistance thermometers, thermocouple, law of thermocouple, materials used for construction, pyrometer, Optical Pyrometer. Strain Measurements, Strain gauge, preparation and mounting of strain gauges, gauge factor, methods of strain measurement    ",
      "descname": "Prescribed text books",
      "descdata": "Text Books:  \n1. Beckwith Marangoni and Lienhard, John H. Lienhard V “Mechanical Measurements”, 6th Ed., 2006, ISBN-13: 978-0201847659.\n  2. R.K. Jain “Engineering Metrology”, Khanna Publishers, 1994, ISBN 13: 9788174091536 \n\nReference Books:   \n1. I.C. Gupta “Engineering Metrology” Dhanpat Rai Publications, Delhi, 2013, ISBN 13: 1234567144039.\n 2. Alsutko, Jerry. D. Faulk “Industrial Instrumentation”, Thompson Asia Pvt. Ltd.2002, ISBN-13: 978-0827361256    ",
      "__v": 0,
      "notesurl": "https://adityam945.github.io/aero-json-files/",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "https://adityam945.github.io/aero-json-files/",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "https://adityam945.github.io/aero-json-files/",
      "qbscreenparams": ""
      }]
  
}]
